# Subsetting and Descriptive Stats

## Before your start:
   - Remember that you just need to do one of the challenges.
   - Keep in mind that you need to use some of the functions you learned in the previous lessons.
   - All datasets are provided in IronHack's database.
   - Elaborate your codes and outputs as much as you can.
   - Try your best to answer the questions and complete the tasks and most importantly: enjoy the process!
   
#### Import all the necessary libraries here:

In [4]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np
from scipy import stats

# [ONLY ONE MANDATORY] Challenge 1
#### In this challenge we will use the `Temp_States`  dataset. 

#### First import it into a dataframe called `temp`.

In [5]:
temp = pd.read_csv('Temp_States.csv')

#### Print `temp`.

In [6]:
temp

         City        State  Temperature
0         NYC     New York    19.444444
1      Albany     New York     9.444444
2     Buffalo     New York     3.333333
3    Hartford  Connecticut    17.222222
4  Bridgeport  Connecticut    14.444444
5      Treton   New Jersey    22.222222
6      Newark   New Jersey    20.000000

#### Explore the data types of the *temp* dataframe. What types of data do we have? Comment your result.

In [9]:
temp.dtypes

City            object
State           object
Temperature    float64
dtype: object

In [ ]:
"""
your comments here
"""

#### Select the rows where state is New York.

In [14]:
temp_ny = temp[temp['State'] == 'New York']
temp_ny

      City     State  Temperature
0      NYC  New York    19.444444
1   Albany  New York     9.444444
2  Buffalo  New York     3.333333

#### What is the average temperature of cities in New York?

In [16]:
temp_ny['Temperature'].values.mean()

10.74074074074074

#### Which states and cities have a temperature above 15 degrees Celsius?

In [22]:
temp_sup_15 = temp[temp['Temperature'] > 15]
temp_sup_15

       City        State  Temperature
0       NYC     New York    19.444444
3  Hartford  Connecticut    17.222222
5    Treton   New Jersey    22.222222
6    Newark   New Jersey    20.000000

#### Now, return only the cities that have a temperature above 15 degrees Celsius.

In [40]:
temp_sup_15_cities = temp_sup_15[['City']]
temp_sup_15_cities

       City
0       NYC
3  Hartford
5    Treton
6    Newark

#### Which cities have a temperature above 15 degrees Celcius and below 20 degrees Celsius?

**Hint**: First, write the condition. Then, select the rows.

In [41]:
temp_1520 = temp_sup_15[temp_sup_15['Temperature'] < 20][['City']]
temp_1520

       City
0       NYC
3  Hartford

#### Find the mean and standard deviation of the temperature of each state.

In [57]:
temp_mean = {}

for st in temp['State'].values:
    mean = temp[temp['State'] == st][['Temperature']].values.mean()
    std = np.std(temp[temp['State'] == st][['Temperature']].values)
    temp_mean[st] = ['mean: ', mean, 'std: ', std]
    
temp_mean

{'New York': ['mean: ', 10.74074074074074, 'std: ', 6.64089669520041],
 'Connecticut': ['mean: ', 15.833333333333332, 'std: ', 1.3888888888888884],
 'New Jersey': ['mean: ', 21.11111111111111, 'std: ', 1.1111111111111107]}

# [ONLY ONE MANDATORY]  Challenge 2

#### Load the `employees` dataset into a dataframe. Call the dataframe `employees`.

In [61]:
employees = pd.read_csv('Employee.csv')
employees

     Name Department Education Gender      Title  Years  Salary
0    Jose         IT  Bachelor      M    analyst      1      35
1   Maria         IT    Master      F    analyst      2      30
2   David         HR    Master      M    analyst      2      30
3   Sonia         HR  Bachelor      F    analyst      4      35
4  Samuel      Sales    Master      M  associate      3      55
5     Eva      Sales  Bachelor      F  associate      2      55
6  Carlos         IT    Master      M         VP      8      70
7   Pedro         IT       Phd      M  associate      7      60
8     Ana         HR    Master      F         VP      8      70

#### Explore the data types of the `employees` dataframe. Comment your results.

In [62]:
employees.dtypes

Name          object
Department    object
Education     object
Gender        object
Title         object
Years          int64
Salary         int64
dtype: object

In [ ]:
"""
your comments here
"""

#### What's the average salary in this company?

In [65]:
employees['Salary'].values.mean()

48.888888888888886

#### What's the highest salary?

In [67]:
employees['Salary'].values.max()

70

#### What's the lowest salary?

In [68]:
employees['Salary'].values.min()

30

#### Who are the employees with the lowest salary?

In [71]:
employees[employees['Salary'] == 30][['Name']]

    Name
1  Maria
2  David

#### Find all the information about an employee called David.

In [72]:
employees[employees['Name'] == 'David']

    Name Department Education Gender    Title  Years  Salary
2  David         HR    Master      M  analyst      2      30

#### Could you return only David's salary?

In [73]:
employees[employees['Name'] == 'David'][['Name', 'Salary']]

    Name  Salary
2  David      30

#### Print all the rows where job title is associate.

In [74]:
employees[employees['Title'] == 'associate']

     Name Department Education Gender      Title  Years  Salary
4  Samuel      Sales    Master      M  associate      3      55
5     Eva      Sales  Bachelor      F  associate      2      55
7   Pedro         IT       Phd      M  associate      7      60

#### Print the first 3 rows of your dataframe.
**Tip**: There are 2 ways to do it. Do it both ways.

In [76]:
employees.head(3)

    Name Department Education Gender    Title  Years  Salary
0   Jose         IT  Bachelor      M  analyst      1      35
1  Maria         IT    Master      F  analyst      2      30
2  David         HR    Master      M  analyst      2      30

In [77]:
employees[:3]

    Name Department Education Gender    Title  Years  Salary
0   Jose         IT  Bachelor      M  analyst      1      35
1  Maria         IT    Master      F  analyst      2      30
2  David         HR    Master      M  analyst      2      30

#### Find the employees whose title is associate and whose salary is above 55.

In [79]:
employees[employees['Title'] == 'associate'][employees['Salary'] > 55]

/var/folders/_4/p643d6050rzf5fwbz9m36nyr0000gn/T/ipykernel_84523/2098955482.py:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  employees[employees['Title'] == 'associate'][employees['Salary'] > 55]

    Name Department Education Gender      Title  Years  Salary
7  Pedro         IT       Phd      M  associate      7      60

#### Group the employees by number of years of employment. What are the average salaries in each group?

In [83]:
employees.groupby(['Years']).agg({'Salary':'mean'})

          Salary
Years
1      35.000000
2      38.333333
3      55.000000
4      35.000000
7      60.000000
8      70.000000

####  What is the average salary per title?

In [84]:
employees.groupby(['Title']).agg({'Salary':'mean'})

              Salary
Title
VP         70.000000
analyst    32.500000
associate  56.666667

####  Find the salary quartiles.

In [94]:
q1 = np.quantile(employees['Salary'].values, 0.25)
q2 = np.quantile(employees['Salary'].values, 0.50)
q3 = np.quantile(employees['Salary'].values, 0.75)

60.0

#### Is the mean salary different per gender?

In [98]:
male_mean_salary = employees[employees['Gender'] == 'M'][['Salary']].values.mean()

female_mean_salary = employees[employees['Gender'] == 'F'][['Salary']].values.mean()

male_mean_salary > female_mean_salary

True

#### Find the minimum, mean and maximum of all numeric columns for each company department.

In [99]:
employees.groupby(['Department']).agg({'Years':['mean','max','min'], 'Salary':['mean','max','min']})

               Years         Salary
                mean max min   mean max min
Department
HR          4.666667   8   2  45.00  70  30
IT          4.500000   8   1  48.75  70  30
Sales       2.500000   3   2  55.00  55  55

#### Bonus Question:  for each department, compute the difference between the maximum and the minimum salary.
**Hint**: try using `agg` or `apply` combined with `lambda` functions.

In [ ]:
# your code here

# [ONLY ONE MANDATORY] Challenge 3
#### Open the `Orders` dataset. Name your dataset `orders`.

#### Explore your dataset by looking at the data types and summary statistics. Comment your results.

In [136]:
"""
your comments here
"""

'\nyour comments here\n'

####  What is the average purchase price?

#### What are the highest and lowest purchase prices?

#### Select all the customers from Spain.
**Hint**: Remember that you are not asked to find orders from Spain but customers. A customer might have more than one order associated.

#### How many customers do we have in Spain?

#### Select all the customers who have bought more than 50 items.
**Hint**: Remember that you are not asked to find orders with more than 50 items but customers who bought more than 50 items. A customer with two orders of 30 items each should appear in the selection.

#### Select orders from Spain that include more than 50 items.

#### Select all free orders.

#### Select all orders whose description starts with `lunch bag`.
**Hint**: use string functions.

#### Select all `lunch bag` orders made in 2011.

In [137]:
# your code here

#### Show the frequency distribution of the amount spent in Spain.

In [138]:
# your code here

#### Select all orders made in the month of August.

In [ ]:
# your code here

#### Find the number of orders made by each country in the month of August.
**Hint**: Use value_counts().

In [ ]:
# your code here

#### What's the  average amount of money spent by country?

In [ ]:
# your code here

#### What's the most expensive item?

In [ ]:
# your code here

#### What is the average amount spent per year?

In [ ]:
# your code here